{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "ab381167",
   "metadata": {},
   "source": [
    "#### Importing Libraries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "341b404b",
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b2e8d6cf",
   "metadata": {},
   "source": [
    "#### Integrating with neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "ba7d3a6b",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph('bolt://localhost:7687', auth=('neo4j', 'nextproject'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "25e6f461",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>n</th></tr><tr><td style=\"text-align:left\">(_0:Encounter {id: &#039;20220001&#039;, operation_code: &#039;CAGM&#039;, operation_date: datetime(&#039;2019-10-11T00:00:00.000000000+00:00&#039;), patient_id: &#039;XYZ00001005&#039;, procedure_weight: 4})</td></tr><tr><td style=\"text-align:left\">(_1:Encounter {id: &#039;20220002&#039;, operation_code: &#039;CAGM&#039;, operation_date: datetime(&#039;2019-06-07T00:00:00.000000000+00:00&#039;), patient_id: &#039;XYZ00005126&#039;, procedure_weight: 5})</td></tr><tr><td style=\"text-align:left\">(_2:Encounter {id: &#039;20220003&#039;, operation_code: &#039;CAGM&#039;, operation_date: datetime(&#039;2019-05-22T00:00:00.000000000+00:00&#039;), patient_id: &#039;XYZ00005235&#039;, procedure_weight: 4})</td></tr></table>"
      ],
      "text/plain": [
       " n                                                                                                                                                                        \n",
       "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
       " (_0:Encounter {id: '20220001', operation_code: 'CAGM', operation_date: datetime('2019-10-11T00:00:00.000000000+00:00'), patient_id: 'XYZ00001005', procedure_weight: 4}) \n",
       " (_1:Encounter {id: '20220002', operation_code: 'CAGM', operation_date: datetime('2019-06-07T00:00:00.000000000+00:00'), patient_id: 'XYZ00005126', procedure_weight: 5}) \n",
       " (_2:Encounter {id: '20220003', operation_code: 'CAGM', operation_date: datetime('2019-05-22T00:00:00.000000000+00:00'), patient_id: 'XYZ00005235', procedure_weight: 4}) "
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query =\"\"\"\n",
    "   match(n) return(n)\n",
    "\"\"\"\n",
    "graph.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "51d07902",
   "metadata": {},
   "outputs": [],
   "source": [
    "def run(query):\n",
    "    return(graph.run(query).stats())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "c29d4783",
   "metadata": {},
   "outputs": [],
   "source": [
    "def index_run(query_list):\n",
    "    for i in query_list:\n",
    "        graph.run(i).stats()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "dbcba6a0",
   "metadata": {},
   "outputs": [],
   "source": [
    "# query1 =[\"CREATE INDEX ON :Encounter(id)\",\n",
    "#          \"CREATE INDEX ON :Patient (id)\",         \n",
    "#          \"CREATE INDEX ON :Condition (code)\",  \n",
    "#          \"CREATE INDEX ON :Procedure (code)\"]\n",
    "\n",
    "# index_run(query1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "99b8c26f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>nodes</th><th>relationships</th></tr><tr><td style=\"text-align:left\">[(_-7:Condition {constraints: [], indexes: [&#039;code&#039;], name: &#039;Condition&#039;}), (_-5:Encounter {constraints: [], indexes: [&#039;id&#039;], name: &#039;Encounter&#039;}), (_-6:Patient {constraints: [], indexes: [&#039;id&#039;], name: &#039;Patient&#039;}), (_-8:Procedure {constraints: [], indexes: [&#039;code&#039;], name: &#039;Procedure&#039;})]</td><td style=\"text-align:left\">[(_-6)-[:HAS_ENCOUNTER {}]-&gt;(_-5), (_-5)-[:HAS_PROCEDURE {}]-&gt;(_-8), (_-5)-[:NEXT {}]-&gt;(_-5), (_-5)-[:HAS_CONDITION {}]-&gt;(_-7), (_-8)-[:SIMILAR {}]-&gt;(_-6), (_-8)-[:SIMILAR {}]-&gt;(_-5), (_-8)-[:SIMILAR {}]-&gt;(_-8)]</td></tr></table>"
      ],
      "text/plain": [
       " nodes                                                                                                                                                                                                                                                                                        | relationships                                                                                                                                                                                                       \n",
       "----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
       " [(_-7:Condition {constraints: [], indexes: ['code'], name: 'Condition'}), (_-5:Encounter {constraints: [], indexes: ['id'], name: 'Encounter'}), (_-6:Patient {constraints: [], indexes: ['id'], name: 'Patient'}), (_-8:Procedure {constraints: [], indexes: ['code'], name: 'Procedure'})] | [(_-6)-[:HAS_ENCOUNTER {}]->(_-5), (_-5)-[:HAS_PROCEDURE {}]->(_-8), (_-5)-[:NEXT {}]->(_-5), (_-5)-[:HAS_CONDITION {}]->(_-7), (_-8)-[:SIMILAR {}]->(_-6), (_-8)-[:SIMILAR {}]->(_-5), (_-8)-[:SIMILAR {}]->(_-8)] "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"call db.schema.visualization\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "df09b058",
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = 'DROP INDEX ON : Condition (code)'\n",
    "# graph.run(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b1ee8337",
   "metadata": {},
   "source": [
    "## Loading CSV Files\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "89b38824",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'labels_added': 15501,\n",
       " 'relationships_created': 8694,\n",
       " 'nodes_created': 15501,\n",
       " 'properties_set': 32889}"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query2 = '''\n",
    "        load csv with headers from \"file:/csv/Encounter.csv\" as row\n",
    "        MERGE (e:Encounter {id:row.ENCOUNTER_ID})\n",
    "          SET \n",
    "            e.operation_date=date(row.OPER_DT),\n",
    "            e.patient_id=row.PATIENT_ID\n",
    "\n",
    "        MERGE (p:Patient {id:row.PATIENT_ID})\n",
    "        \n",
    "        MERGE (p)-[:HAS_ENCOUNTER]->(e)\n",
    "        \n",
    "        '''\n",
    "run(query2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "4b6da2b7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'properties_set': 21917}"
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query3 = '''\n",
    "      load csv with headers from \"file:/csv/Patients.csv\" as row\n",
    "      MERGE (p:Patient {id:row.PATIENT_ID})\n",
    "          SET\n",
    "               p.Name=row.PATIENT_NAME, \n",
    "               p.gender=row.GENDER,            \n",
    "               p.weight=row.WEIGHT,\n",
    "               p.height=row.HEIGHT\n",
    "\n",
    "        '''\n",
    "run(query3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "9dc0a1b7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'labels_added': 8694,\n",
       " 'relationships_created': 8694,\n",
       " 'nodes_created': 8694,\n",
       " 'properties_set': 28224}"
      ]
     },
     "execution_count": 65,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query4 = '''\n",
    "      load csv with headers from \"file:/csv/Condition.csv\" as row\n",
    "      MATCH (p:Patient {id:row.PATIENT_ID})\n",
    "        MERGE (c:Condition {code:row.ENCOUNTER_ID})\n",
    "        SET \n",
    "            c.description=row.DIAGNOSIS_ICD_TEXT,\n",
    "            c.diagnosis = row.DIAGNOSIS,\n",
    "            c.operation_date = datetime(row.OPER_DT)\n",
    "        \n",
    "        MERGE (cs:Encounter {id:row.ENCOUNTER_ID})\n",
    "        ON CREATE\n",
    "          SET cs.date=datetime(row.OPER_DT) \n",
    "          \n",
    "        MERGE (p)-[:HAS_ENCOUNTER]->(cs)\n",
    "        MERGE (cs)-[:HAS_CONDITION]->(c)\n",
    "\n",
    "        '''\n",
    "run(query4)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "2af08de2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'labels_added': 367,\n",
       " 'relationships_created': 8694,\n",
       " 'nodes_created': 367,\n",
       " 'properties_set': 43837}"
      ]
     },
     "execution_count": 66,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query2 = '''\n",
    "      load csv with headers from \"file:/csv/Procedures.csv\" as row\n",
    "      MERGE (p:Patient {id:row.PATIENT_ID})\n",
    "      MERGE (r:Procedure {code:row.OPERCODE})\n",
    "          \n",
    "          SET \n",
    "              r.description=row.OPER_NAME,\n",
    "              r.operation_date=datetime(row.OPER_DT),\n",
    "              r.cost = row.COST\n",
    "          MERGE (pe:Encounter {id:row.ENCOUNTER_ID})\n",
    "          \n",
    "          ON MATCH\n",
    "            SET pe.operation_date=datetime(row.OPER_DT), pe.operation_code=row.OPERCODE\n",
    "\n",
    "          MERGE (p)-[:HAS_ENCOUNTER]->(pe)\n",
    "          MERGE (pe)-[:HAS_PROCEDURE]->(r)\n",
    "        '''\n",
    "run(query2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7f0191fd",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "908815a9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{}"
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query2 = '''\n",
    "\n",
    "    CALL apoc.periodic.iterate(\n",
    "    'MATCH (p:Patient) RETURN p',\n",
    "    'MATCH (p)-[:HAS_ENCOUNTER]->(e)\n",
    "    WITH e\n",
    "    ORDER BY e.operation_date\n",
    "    WITH collect(e) AS encounters\n",
    "    WITH encounters, encounters[1..] as nextEncounters\n",
    "    UNWIND range(0,size(nextEncounters)-1,1) as index\n",
    "    WITH encounters[index] as first, nextEncounters[index] as second\n",
    "    CREATE (first)-[:NEXT{days:duration.inDays(date(first.operation_date), date(second.operation_date))}]->(second)',{iterateList:false});\n",
    "    \n",
    "    '''\n",
    "run(query2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "7afe1824",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{}"
      ]
     },
     "execution_count": 69,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query2 = '''\n",
    "       CALL apoc.periodic.iterate('MATCH (c:Condition) RETURN c',\n",
    "      'MATCH (c)<-[:HAS_CONDITION]-(:Encounter)<-[:HAS_ENCOUNTER]-(p:Patient)\n",
    "      WITH c,count(p) AS NUM\n",
    "      SET c.num=NUM', {}\n",
    "      );\n",
    "    '''\n",
    "run(query2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0d7fbc73",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4d29f8e6",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "3066d21c",
   "metadata": {},
   "source": [
    "# Insights"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "998b061c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Patient_id</th>\n",
       "      <th>Patient_name</th>\n",
       "      <th>sequence</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ABC00579733</td>\n",
       "      <td>RENJITH R  PAI</td>\n",
       "      <td>[CAGM, EPS, RFA]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ABC00564991</td>\n",
       "      <td>AJAY SAH</td>\n",
       "      <td>[CAGM, PAGM, PTAAB]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ABC00338680</td>\n",
       "      <td>NIRANJAN DEY</td>\n",
       "      <td>[CAGM, A203]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ABC00591287</td>\n",
       "      <td>RUDRARAJU ADITYA VARMA</td>\n",
       "      <td>[CAGM, ICDI]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ABC00587272</td>\n",
       "      <td>S MAIMUNNISA BEGUM</td>\n",
       "      <td>[CAGM, PTCAP]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6802</th>\n",
       "      <td>ABC00579426</td>\n",
       "      <td>BHOLANATH DHAL</td>\n",
       "      <td>[UROPER7]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6803</th>\n",
       "      <td>ABC00583567</td>\n",
       "      <td>KABITA SARKAR</td>\n",
       "      <td>[UROPER17]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6804</th>\n",
       "      <td>ABC00589884</td>\n",
       "      <td>MST MURSHIDA KHATUN</td>\n",
       "      <td>[UROPER17]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6805</th>\n",
       "      <td>ABC00598605</td>\n",
       "      <td>SURESH HALDAR</td>\n",
       "      <td>[UROPER4]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6806</th>\n",
       "      <td>ABC00600512</td>\n",
       "      <td>NABAKUMAR DEKA</td>\n",
       "      <td>[UROPER18]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>6807 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       Patient_id            Patient_name             sequence\n",
       "0     ABC00579733         RENJITH R  PAI      [CAGM, EPS, RFA]\n",
       "1     ABC00564991                AJAY SAH  [CAGM, PAGM, PTAAB]\n",
       "2     ABC00338680           NIRANJAN DEY          [CAGM, A203]\n",
       "3     ABC00591287  RUDRARAJU ADITYA VARMA         [CAGM, ICDI]\n",
       "4     ABC00587272      S MAIMUNNISA BEGUM        [CAGM, PTCAP]\n",
       "...           ...                     ...                  ...\n",
       "6802  ABC00579426          BHOLANATH DHAL            [UROPER7]\n",
       "6803  ABC00583567           KABITA SARKAR           [UROPER17]\n",
       "6804  ABC00589884     MST MURSHIDA KHATUN           [UROPER17]\n",
       "6805  ABC00598605           SURESH HALDAR            [UROPER4]\n",
       "6806  ABC00600512          NABAKUMAR DEKA           [UROPER18]\n",
       "\n",
       "[6807 rows x 3 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query to get patients and procedures\n",
    "\n",
    "query = '''\n",
    "    MATCH (p:Patient)-[:HAS_ENCOUNTER]->(e:Encounter)-[:HAS_PROCEDURE]->(pr:Procedure)\n",
    "    return p.id as Patient_id,p.Name as Patient_name,collect(pr.code) as sequence\n",
    "'''\n",
    "df3 = pd.DataFrame(graph.query(query).to_data_frame())\n",
    "df3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "7055f69c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# # Getting patients who followed CAGM, PTCAP\n",
    "\n",
    "# df3['sequence'] = df3['sequence'].astype(str)\n",
    "# df_new1= df3[df3['sequence'] == \"['CAGM', 'P1703']\"]\n",
    "# df_new1\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "d12922f7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.id</th>\n",
       "      <th>p.Name</th>\n",
       "      <th>pr.code</th>\n",
       "      <th>pr1.code</th>\n",
       "      <th>count(*)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ABC00556697</td>\n",
       "      <td>FATHIMA SAFEEDA V T</td>\n",
       "      <td>AVBDL</td>\n",
       "      <td>AVBDL</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          p.id               p.Name pr.code pr1.code  count(*)\n",
       "0  ABC00556697  FATHIMA SAFEEDA V T   AVBDL    AVBDL         1"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query to get patients and procedures\n",
    "\n",
    "query = '''\n",
    "    MATCH (p:Patient)-[:HAS_ENCOUNTER]->(e:Encounter)-[:HAS_PROCEDURE]->(pr:Procedure{code:\"AVBDL\"})\n",
    " match (e)-[:NEXT]->(e1:Encounter)-[:HAS_PROCEDURE]->(pr1:Procedure{code:\"AVBDL\"})\n",
    " return p.id,p.Name,pr.code,pr1.code,count(*)\n",
    "'''\n",
    "df1 = pd.DataFrame(graph.query(query).to_data_frame())\n",
    "# patient = pd.DataFrame(graph.query(query).to_data_frame())\n",
    "# type(result_df)\n",
    "df1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "52ce3a2e",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "e28c548c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Patient_id</th>\n",
       "      <th>Patient_name</th>\n",
       "      <th>sequence</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>821</th>\n",
       "      <td>ABC00174021</td>\n",
       "      <td>LEELA T S</td>\n",
       "      <td>[CAGM, PTMCM, P1703]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      Patient_id Patient_name              sequence\n",
       "821  ABC00174021    LEELA T S  [CAGM, PTMCM, P1703]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db = df3[df3['Patient_name']=='LEELA T S']\n",
    "db"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "352b5d97",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "list"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "type(df3['sequence'][0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "65c4e188",
   "metadata": {
    "scrolled": false
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "8dd92d12",
   "metadata": {},
   "outputs": [],
   "source": [
    "# procedure = df3[\"sequence\"].apply(pd.Series)\n",
    "# procedure.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 213,
   "id": "e107bdd7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# result = pd.concat([patient,procedure], axis=1, join='inner')\n",
    "# result = result.fillna(0)\n",
    "# result = pd.DataFrame(result)\n",
    "# result.columns = ['Patient_Name','1st','2nd','3rd','4th','5th','6th','7th','8th','9th','10th']\n",
    "# result.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ec8b87b2",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "e0fc992d",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "    ct \r\n",
      "-------\r\n",
      " 24562 \r\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Counting no of nodes in our graph\n",
    "\n",
    "query1 = \"\"\"\n",
    "Match(n) return count(n) as ct\n",
    "\"\"\"\n",
    "result = graph.query(query1)\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "18245acc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "145"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Returning Patients names who followed CAGM after P1703\n",
    "params = {'p1':'CAGM',\n",
    "          'p2':'PTCAP'}\n",
    "\n",
    "query2 = \"\"\"\n",
    "        match(n:Patient)-[:HAS_ENCOUNTER]->(e:Encounter{operation_code:$p1})-[:NEXT]->(e1:Encounter{operation_code:$p2})\n",
    "        //where e1.operation_code CONTAINS $contains \n",
    "        return n.id as id\n",
    "         \"\"\"\n",
    "\n",
    "result_df1 = pd.DataFrame(graph.query(query2,parameters = params).to_data_frame())\n",
    "len(result_df1.id.unique())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "215ee02c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.code</th>\n",
       "      <th>inDegree</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>CAGM</td>\n",
       "      <td>933</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>PTCAP</td>\n",
       "      <td>924</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>P103</td>\n",
       "      <td>335</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>EPS</td>\n",
       "      <td>296</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>PTMCM</td>\n",
       "      <td>288</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>362</th>\n",
       "      <td>ORTHOPER14</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>363</th>\n",
       "      <td>UROPER23</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>364</th>\n",
       "      <td>UROPER12</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>365</th>\n",
       "      <td>UROPER4</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>366</th>\n",
       "      <td>UROPER18</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>367 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "         p.code  inDegree\n",
       "0          CAGM       933\n",
       "1         PTCAP       924\n",
       "2          P103       335\n",
       "3           EPS       296\n",
       "4         PTMCM       288\n",
       "..          ...       ...\n",
       "362  ORTHOPER14         1\n",
       "363    UROPER23         1\n",
       "364    UROPER12         1\n",
       "365     UROPER4         1\n",
       "366    UROPER18         1\n",
       "\n",
       "[367 rows x 2 columns]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Counting indegress for different procedures \n",
    "# Also we can know here that which procedure is followed by most of the patients.\n",
    "\n",
    "query3 = \"\"\"\n",
    "    match(p:Procedure)\n",
    "    return distinct p.code, SIZE(()-[]->(p)) AS inDegree ORDER BY inDegree DESC\n",
    "         \"\"\"\n",
    "result1 = graph.query(query3).to_data_frame()\n",
    "result1\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a149a676",
   "metadata": {},
   "source": [
    "## Assosciation rule mining\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "99e15561",
   "metadata": {},
   "outputs": [],
   "source": [
    "# # Query to get patients and procedures\n",
    "\n",
    "# query = '''\n",
    "#     MATCH (p:Patient)-[:HAS_ENCOUNTER]->(e:Encounter)-[:HAS_PROCEDURE]->(pr:Procedure)\n",
    "#     return p.id as Patient_id,collect(pr.code) as sequence\n",
    "# '''\n",
    "# df3 = pd.DataFrame(graph.query(query).to_data_frame())\n",
    "# # patient = pd.DataFrame(graph.query(query).to_data_frame())\n",
    "# # type(result_df)\n",
    "# df3"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "308a1d97",
   "metadata": {},
   "source": [
    "## Support ,Confidence and Lift"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a3ac9e1a",
   "metadata": {},
   "source": [
    "### Function for support"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "bf1938d2",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "            match (c:Patient)\n",
    "            CALL   {\n",
    "                with c \n",
    "                return count(c) as mycount\n",
    "                }\n",
    "                with sum(mycount)as count1\n",
    "                MATCH p=(e:Encounter)-[:NEXT*0..]->()\n",
    "                UNWIND nodes(p) as node\n",
    "                WITH e,p, collect(node.operation_code) as Procedures,count1\n",
    "                with Procedures , round(toFloat(count(*))/count1,5) as Support,count(*) as count\n",
    "                order by count desc\n",
    "                return  Procedures,Support, count\n",
    "        \n",
    "        \"\"\"\n",
    "\n",
    "df4 = pd.DataFrame(graph.query(query).to_data_frame())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "85b76642",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Procedures</th>\n",
       "      <th>Support</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[CAGM]</td>\n",
       "      <td>0.13706</td>\n",
       "      <td>933</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[PTCAP]</td>\n",
       "      <td>0.13574</td>\n",
       "      <td>924</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[P103]</td>\n",
       "      <td>0.04921</td>\n",
       "      <td>335</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[EPS]</td>\n",
       "      <td>0.04348</td>\n",
       "      <td>296</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[PTMCM]</td>\n",
       "      <td>0.04231</td>\n",
       "      <td>288</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1444</th>\n",
       "      <td>[UROPER7, UROPER3]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1445</th>\n",
       "      <td>[UROPER7, UROPER3, UROPER2]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1446</th>\n",
       "      <td>[UROPER18]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1447</th>\n",
       "      <td>[UROPER1, OBGOPER27]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1448</th>\n",
       "      <td>[UROPER6, UROPER6]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1449 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                       Procedures  Support  count\n",
       "0                          [CAGM]  0.13706    933\n",
       "1                         [PTCAP]  0.13574    924\n",
       "2                          [P103]  0.04921    335\n",
       "3                           [EPS]  0.04348    296\n",
       "4                         [PTMCM]  0.04231    288\n",
       "...                           ...      ...    ...\n",
       "1444           [UROPER7, UROPER3]  0.00015      1\n",
       "1445  [UROPER7, UROPER3, UROPER2]  0.00015      1\n",
       "1446                   [UROPER18]  0.00015      1\n",
       "1447         [UROPER1, OBGOPER27]  0.00015      1\n",
       "1448           [UROPER6, UROPER6]  0.00015      1\n",
       "\n",
       "[1449 rows x 3 columns]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "c4ea37a4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Procedures</th>\n",
       "      <th>Support</th>\n",
       "      <th>Confidence</th>\n",
       "      <th>Lift</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[CAGM]</td>\n",
       "      <td>0.13706</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[PTCAP]</td>\n",
       "      <td>0.13574</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[P103]</td>\n",
       "      <td>0.04921</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[EPS]</td>\n",
       "      <td>0.04348</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[PTMCM]</td>\n",
       "      <td>0.04231</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  Procedures  Support  Confidence  Lift\n",
       "0     [CAGM]  0.13706           0     0\n",
       "1    [PTCAP]  0.13574           0     0\n",
       "2     [P103]  0.04921           0     0\n",
       "3      [EPS]  0.04348           0     0\n",
       "4    [PTMCM]  0.04231           0     0"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df7 = df4\n",
    "df7[\"Confidence\"]=0\n",
    "df7['Lift']=0\n",
    "df7.drop('count',axis=1,inplace=True)\n",
    "df7.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8df31ffa",
   "metadata": {},
   "source": [
    "### Function for Confidence"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "bf6a4adf",
   "metadata": {},
   "outputs": [],
   "source": [
    "for i in range(0,df7.shape[0]):\n",
    "    if(len(df7.iloc[i,0])==1):\n",
    "        df7.iloc[i,2]= 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "b35a6e14",
   "metadata": {},
   "outputs": [],
   "source": [
    "seq=\"\"\n",
    "for i in range(0,df7.shape[0]):\n",
    "    if(len(df7.iloc[i,0])>1):\n",
    "        seq= df7.iloc[i,0].copy()\n",
    "        support1= df7.iloc[i,1]\n",
    "        seq.pop()\n",
    "        for j in range(0,i):\n",
    "            if(seq==df7.iloc[j,0]):\n",
    "                support2= df7.iloc[j,1]\n",
    "        df7.iloc[i,2]= round((support1/support2),5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "842fe3a1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Procedures</th>\n",
       "      <th>Support</th>\n",
       "      <th>Confidence</th>\n",
       "      <th>Lift</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1444</th>\n",
       "      <td>[UROPER7, UROPER3]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.34091</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1445</th>\n",
       "      <td>[UROPER7, UROPER3, UROPER2]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>1.00000</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1446</th>\n",
       "      <td>[UROPER18]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>1.00000</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1447</th>\n",
       "      <td>[UROPER1, OBGOPER27]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.20548</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1448</th>\n",
       "      <td>[UROPER6, UROPER6]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.09259</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                       Procedures  Support  Confidence  Lift\n",
       "1444           [UROPER7, UROPER3]  0.00015     0.34091     0\n",
       "1445  [UROPER7, UROPER3, UROPER2]  0.00015     1.00000     0\n",
       "1446                   [UROPER18]  0.00015     1.00000     0\n",
       "1447         [UROPER1, OBGOPER27]  0.00015     0.20548     0\n",
       "1448           [UROPER6, UROPER6]  0.00015     0.09259     0"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df7.tail()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "b815f8af",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1262"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "895+367\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d54fd1dd",
   "metadata": {},
   "source": [
    "### Function for Lift"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "d1d83e1e",
   "metadata": {},
   "outputs": [],
   "source": [
    "seq=\"\"\n",
    "support1= suppor2= support3=1\n",
    "for i in range(0,df7.shape[0]):\n",
    "    if(len(df7.iloc[i,0])>1):\n",
    "        seq= df7.iloc[i,0].copy()\n",
    "        support1= df7.iloc[i,1]\n",
    "        popped= seq.pop()\n",
    "        for k in range(0,i):\n",
    "            if(list(popped.split(\" \"))==df7.iloc[k,0]):\n",
    "                support3= df7.iloc[k,1]\n",
    "        for j in range(0,i):\n",
    "            if(seq==df7.iloc[j,0]):\n",
    "                support2= df7.iloc[j,1]\n",
    "        df7.iloc[i,3]= round(support1/(support2*support3),5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "b28797d5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Procedures</th>\n",
       "      <th>Support</th>\n",
       "      <th>Confidence</th>\n",
       "      <th>Lift</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[CAGM]</td>\n",
       "      <td>0.13706</td>\n",
       "      <td>1.00000</td>\n",
       "      <td>0.00000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[PTCAP]</td>\n",
       "      <td>0.13574</td>\n",
       "      <td>1.00000</td>\n",
       "      <td>0.00000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[P103]</td>\n",
       "      <td>0.04921</td>\n",
       "      <td>1.00000</td>\n",
       "      <td>0.00000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[EPS]</td>\n",
       "      <td>0.04348</td>\n",
       "      <td>1.00000</td>\n",
       "      <td>0.00000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[PTMCM]</td>\n",
       "      <td>0.04231</td>\n",
       "      <td>1.00000</td>\n",
       "      <td>0.00000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1444</th>\n",
       "      <td>[UROPER7, UROPER3]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.34091</td>\n",
       "      <td>288.90601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1445</th>\n",
       "      <td>[UROPER7, UROPER3, UROPER2]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>1.00000</td>\n",
       "      <td>295.85799</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1446</th>\n",
       "      <td>[UROPER18]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>1.00000</td>\n",
       "      <td>0.00000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1447</th>\n",
       "      <td>[UROPER1, OBGOPER27]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.20548</td>\n",
       "      <td>35.86029</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1448</th>\n",
       "      <td>[UROPER6, UROPER6]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.09259</td>\n",
       "      <td>57.15592</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1449 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                       Procedures  Support  Confidence       Lift\n",
       "0                          [CAGM]  0.13706     1.00000    0.00000\n",
       "1                         [PTCAP]  0.13574     1.00000    0.00000\n",
       "2                          [P103]  0.04921     1.00000    0.00000\n",
       "3                           [EPS]  0.04348     1.00000    0.00000\n",
       "4                         [PTMCM]  0.04231     1.00000    0.00000\n",
       "...                           ...      ...         ...        ...\n",
       "1444           [UROPER7, UROPER3]  0.00015     0.34091  288.90601\n",
       "1445  [UROPER7, UROPER3, UROPER2]  0.00015     1.00000  295.85799\n",
       "1446                   [UROPER18]  0.00015     1.00000    0.00000\n",
       "1447         [UROPER1, OBGOPER27]  0.00015     0.20548   35.86029\n",
       "1448           [UROPER6, UROPER6]  0.00015     0.09259   57.15592\n",
       "\n",
       "[1449 rows x 4 columns]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df7\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "8685eddc",
   "metadata": {},
   "outputs": [],
   "source": [
    "# query = '''\n",
    "#         MATCH (p:Patient)-[:HAS_ENCOUNTER]->(e:Encounter)\n",
    "#         WITH p,e\n",
    "#         ORDER BY e.operation_date\n",
    "#         with p.id as Patient_Id, p.Name as Patient_Name,collect(e.operation_code) as sequence\n",
    "#         return sequence, count(Patient_Id) as count\n",
    "#         order by count(Patient_Id) descending\n",
    "# '''\n",
    "# df7 = pd.DataFrame(graph.query(query).to_data_frame())\n",
    "# # display(df7.to_string())\n",
    "# df7.to_csv('895.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "40743d64",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_indices(df7,x):\n",
    "        val = x\n",
    "        indices =  []\n",
    "\n",
    "        for i in range(df7.shape[0]):\n",
    "            seq1= df7.iloc[i,0].copy()\n",
    "            popped= seq1.pop()\n",
    "            #print(popped)   \n",
    "            if(list(popped.split(\" \"))==list(val.split(\" \"))):\n",
    "                indices.append(i)\n",
    "\n",
    "        newdf = df7.iloc[indices, :]\n",
    "        return(newdf)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "9fa320c8",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_SCL(df7,x):\n",
    "    newdf = get_indices(df7,x)\n",
    "    # Create an empty list\n",
    "    Row_list =[] \n",
    "    Row_list1 = []\n",
    "    Row_list2 =[]\n",
    "    my_list2 = []\n",
    "    # Iterate over each row\n",
    "    for index, rows in newdf.iterrows():\n",
    "    # Create list for the current row\n",
    "        if rows.Lift > 0.95 :\n",
    "#         my_list =[rows.Procedures, rows.Support]\n",
    "#         my_list1 = [rows.Procedures,rows.Confidence]\n",
    "            my_list2 = [rows.Procedures,rows.Lift]\n",
    "\n",
    "    # append the list to the final list\n",
    "#         Row_list.append(my_list)\n",
    "#         Row_list1.append(my_list1)\n",
    "        Row_list2.append(my_list2)\n",
    "\n",
    "    # Print the list\n",
    "#     print(Row_list) \n",
    "#     print(\"\\n\")\n",
    "#     print(Row_list1)\n",
    "#     print(\"\\n\")\n",
    "    print(Row_list2)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "c1382d89",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[[], [['CAGM', 'PAGM'], 1.43316], [['CAGM', 'PAGM'], 1.43316], [['PTASU', 'PAGM'], 55.80357], [['LRHCATH', 'PAGM'], 1.52649], [['PTCAP', 'CAGM', 'PAGM'], 1.56282], [['PTAIL', 'PAGM'], 54.85775], [['PTPA', 'PAGM'], 24.51975], [['CAGM', 'PAGM', 'PAGM'], 9.51197], [['PAGM', 'PAGM'], 1.86842], [['CAGM', 'A204', 'PTAIL', 'PAGM'], 111.60714], [['CAGM', 'CAGM', 'PAGM'], 5.69424], [['PAGM', 'CAGM', 'CAGM', 'PAGM'], 111.60714], [['CAGM', 'PTPA', 'PAGM'], 111.60714], [['PAGM', 'PTACA', 'CAGM', 'PTPA', 'PAGM'], 111.60714], [['PTACA', 'CAGM', 'PTPA', 'PAGM'], 111.60714], [['PTASU', 'PAGM', 'PTACA', 'CAGM', 'PTPA', 'PAGM'], 111.60714], [['PTASU', 'PAGM', 'PTACA', 'CAGM', 'PTPA', 'PAGM'], 111.60714], [['CAGM', 'P2437', 'PAGM'], 16.25347], [['PAGM', 'CAGM', 'P2437', 'PAGM'], 111.60714], [['PTAAB', 'PAGM'], 38.04789], [['RSOVDV', 'LRHCATH', 'PAGM'], 111.60714], [['PAGM', 'CAGM', 'PAGM'], 7.12386], [['A204', 'PTAIL', 'PAGM'], 111.60714], [['P2437', 'PAGM'], 1.46083]]\n"
     ]
    }
   ],
   "source": [
    "get_SCL(df7,'PAGM')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "c8713140",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Single_Procedure</th>\n",
       "      <th>Count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[CAGM]</td>\n",
       "      <td>933</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[PTCAP]</td>\n",
       "      <td>924</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[P103]</td>\n",
       "      <td>335</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[EPS]</td>\n",
       "      <td>296</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[PTMCM]</td>\n",
       "      <td>288</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>362</th>\n",
       "      <td>[CRAATEL]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>363</th>\n",
       "      <td>[UROPER4]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>364</th>\n",
       "      <td>[CRABFSFD]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>365</th>\n",
       "      <td>[CRARSOB]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>366</th>\n",
       "      <td>[EXS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>367 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    Single_Procedure  Count\n",
       "0             [CAGM]    933\n",
       "1            [PTCAP]    924\n",
       "2             [P103]    335\n",
       "3              [EPS]    296\n",
       "4            [PTMCM]    288\n",
       "..               ...    ...\n",
       "362        [CRAATEL]      1\n",
       "363        [UROPER4]      1\n",
       "364       [CRABFSFD]      1\n",
       "365        [CRARSOB]      1\n",
       "366            [EXS]      1\n",
       "\n",
       "[367 rows x 2 columns]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = '''\n",
    "        //single procedure and involving count\n",
    "        MATCH (p:Patient)-[:HAS_ENCOUNTER]->(e:Encounter)\n",
    "        WITH p,e\n",
    "        ORDER BY e.operation_date\n",
    "        with p.id as Patient_Id, p.Name as Patient_Name,collect(e.operation_code) as Single_Procedure,e\n",
    "        return Single_Procedure,count(Patient_Id) as Count\n",
    "        order by Count descending\n",
    "'''\n",
    "df10 = pd.DataFrame(graph.query(query).to_data_frame())\n",
    "df10"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "d4ba877e",
   "metadata": {},
   "outputs": [],
   "source": [
    "df10[\"Support\"]=df10['Confidence']=df10['Lift']=0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "e4af7a87",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Single_Procedure</th>\n",
       "      <th>Count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[CAGM]</td>\n",
       "      <td>933</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[PTCAP]</td>\n",
       "      <td>924</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[P103]</td>\n",
       "      <td>335</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[EPS]</td>\n",
       "      <td>296</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[PTMCM]</td>\n",
       "      <td>288</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>[EMS]</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>[AVBDL]</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>[OPHTOPER10]</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>[ORTHOPER18]</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>[CRAPD]</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>80 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   Single_Procedure  Count\n",
       "0            [CAGM]    933\n",
       "1           [PTCAP]    924\n",
       "2            [P103]    335\n",
       "3             [EPS]    296\n",
       "4           [PTMCM]    288\n",
       "..              ...    ...\n",
       "75            [EMS]     19\n",
       "76          [AVBDL]     18\n",
       "77     [OPHTOPER10]     18\n",
       "78     [ORTHOPER18]     18\n",
       "79          [CRAPD]     18\n",
       "\n",
       "[80 rows x 2 columns]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df10.head(80)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "2844a032",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Procedures</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[PAGM, PTAIL]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[PTMCM, CAGM]</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[EPS, RFA]</td>\n",
       "      <td>146</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[CAGM, P1703]</td>\n",
       "      <td>36</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[LRHCATH, P2437]</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>584</th>\n",
       "      <td>[UROPER35, UROPER33]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>585</th>\n",
       "      <td>[UROPER31, UROPER31]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>586</th>\n",
       "      <td>[UROPER5, UROPER7]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>587</th>\n",
       "      <td>[UROPER7, UROPER3]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>588</th>\n",
       "      <td>[UROPER6, UROPER6]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>589 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "               Procedures  count\n",
       "0           [PAGM, PTAIL]      1\n",
       "1           [PTMCM, CAGM]     11\n",
       "2              [EPS, RFA]    146\n",
       "3           [CAGM, P1703]     36\n",
       "4        [LRHCATH, P2437]      5\n",
       "..                    ...    ...\n",
       "584  [UROPER35, UROPER33]      1\n",
       "585  [UROPER31, UROPER31]      1\n",
       "586    [UROPER5, UROPER7]      1\n",
       "587    [UROPER7, UROPER3]      1\n",
       "588    [UROPER6, UROPER6]      1\n",
       "\n",
       "[589 rows x 2 columns]"
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = '''\n",
    "        MATCH p=(e:Encounter)-[:NEXT]->(e1)\n",
    "        // WHERE exists((e1)-[:NEXT]->())\n",
    "        UNWIND nodes(p) as node\n",
    "        WITH e,p, collect(node.operation_code) as Procedures\n",
    "        with distinct Procedures, count(*)  as count\n",
    "        //UNWIND range(0, size(names) - 2) as index\n",
    "        //WITH names[index] as Procedure1, names[index+1] as Procedure2,count\n",
    "        //return Procedure1,Procedure2, count \n",
    "        return Procedures, count\n",
    "        //create (a:Node{Proc:node1})-[t:TO]->(b:Node{Proc:node2})\n",
    "\n",
    "\n",
    "'''\n",
    "df4 = pd.DataFrame(graph.query(query).to_data_frame())\n",
    "# df4.to_csv(\"sssihms_scl.csv\", index = False)\n",
    "# df4.to_csv('count.csv')\n",
    "df4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "d800be0d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Procedures</th>\n",
       "      <th>count</th>\n",
       "      <th>Procedure1</th>\n",
       "      <th>Procedure2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[PAGM, PTAIL]</td>\n",
       "      <td>1</td>\n",
       "      <td>PAGM</td>\n",
       "      <td>PTAIL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[PTMCM, CAGM]</td>\n",
       "      <td>11</td>\n",
       "      <td>PTMCM</td>\n",
       "      <td>CAGM</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[EPS, RFA]</td>\n",
       "      <td>146</td>\n",
       "      <td>EPS</td>\n",
       "      <td>RFA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[CAGM, P1703]</td>\n",
       "      <td>36</td>\n",
       "      <td>CAGM</td>\n",
       "      <td>P1703</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[LRHCATH, P2437]</td>\n",
       "      <td>5</td>\n",
       "      <td>LRHCATH</td>\n",
       "      <td>P2437</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>584</th>\n",
       "      <td>[UROPER35, UROPER33]</td>\n",
       "      <td>1</td>\n",
       "      <td>UROPER35</td>\n",
       "      <td>UROPER33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>585</th>\n",
       "      <td>[UROPER31, UROPER31]</td>\n",
       "      <td>1</td>\n",
       "      <td>UROPER31</td>\n",
       "      <td>UROPER31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>586</th>\n",
       "      <td>[UROPER5, UROPER7]</td>\n",
       "      <td>1</td>\n",
       "      <td>UROPER5</td>\n",
       "      <td>UROPER7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>587</th>\n",
       "      <td>[UROPER7, UROPER3]</td>\n",
       "      <td>1</td>\n",
       "      <td>UROPER7</td>\n",
       "      <td>UROPER3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>588</th>\n",
       "      <td>[UROPER6, UROPER6]</td>\n",
       "      <td>1</td>\n",
       "      <td>UROPER6</td>\n",
       "      <td>UROPER6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>589 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "               Procedures  count Procedure1 Procedure2\n",
       "0           [PAGM, PTAIL]      1       PAGM      PTAIL\n",
       "1           [PTMCM, CAGM]     11      PTMCM       CAGM\n",
       "2              [EPS, RFA]    146        EPS        RFA\n",
       "3           [CAGM, P1703]     36       CAGM      P1703\n",
       "4        [LRHCATH, P2437]      5    LRHCATH      P2437\n",
       "..                    ...    ...        ...        ...\n",
       "584  [UROPER35, UROPER33]      1   UROPER35   UROPER33\n",
       "585  [UROPER31, UROPER31]      1   UROPER31   UROPER31\n",
       "586    [UROPER5, UROPER7]      1    UROPER5    UROPER7\n",
       "587    [UROPER7, UROPER3]      1    UROPER7    UROPER3\n",
       "588    [UROPER6, UROPER6]      1    UROPER6    UROPER6\n",
       "\n",
       "[589 rows x 4 columns]"
      ]
     },
     "execution_count": 69,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "newdf3  = pd.DataFrame(df4['Procedures'].tolist(),columns=['Procedure1','Procedure2'],index = df4.index)\n",
    "df4 = pd.concat([df4,newdf3],axis = 1)\n",
    "df4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "0c10bff5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Procedures</th>\n",
       "      <th>Support</th>\n",
       "      <th>Confidence</th>\n",
       "      <th>Lift</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[EPS, RFA]</td>\n",
       "      <td>0.02145</td>\n",
       "      <td>0.49333</td>\n",
       "      <td>12.67224</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[CAGM, PTCAP]</td>\n",
       "      <td>0.02130</td>\n",
       "      <td>0.15541</td>\n",
       "      <td>1.14488</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[PTCAP, CAGM]</td>\n",
       "      <td>0.02071</td>\n",
       "      <td>0.15257</td>\n",
       "      <td>1.11317</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[RFA, EPS]</td>\n",
       "      <td>0.01851</td>\n",
       "      <td>0.47547</td>\n",
       "      <td>10.93534</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>[CAGM, A203]</td>\n",
       "      <td>0.00926</td>\n",
       "      <td>0.06756</td>\n",
       "      <td>2.77006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1436</th>\n",
       "      <td>[UROPER29, OBGOPER27]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.12712</td>\n",
       "      <td>22.18475</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1441</th>\n",
       "      <td>[UROPER5, UROPER7]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.34091</td>\n",
       "      <td>774.79339</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1444</th>\n",
       "      <td>[UROPER7, UROPER3]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.34091</td>\n",
       "      <td>288.90601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1447</th>\n",
       "      <td>[UROPER1, OBGOPER27]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.20548</td>\n",
       "      <td>35.86029</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1448</th>\n",
       "      <td>[UROPER6, UROPER6]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.09259</td>\n",
       "      <td>57.15592</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>589 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                 Procedures  Support  Confidence       Lift\n",
       "11               [EPS, RFA]  0.02145     0.49333   12.67224\n",
       "12            [CAGM, PTCAP]  0.02130     0.15541    1.14488\n",
       "14            [PTCAP, CAGM]  0.02071     0.15257    1.11317\n",
       "16               [RFA, EPS]  0.01851     0.47547   10.93534\n",
       "34             [CAGM, A203]  0.00926     0.06756    2.77006\n",
       "...                     ...      ...         ...        ...\n",
       "1436  [UROPER29, OBGOPER27]  0.00015     0.12712   22.18475\n",
       "1441     [UROPER5, UROPER7]  0.00015     0.34091  774.79339\n",
       "1444     [UROPER7, UROPER3]  0.00015     0.34091  288.90601\n",
       "1447   [UROPER1, OBGOPER27]  0.00015     0.20548   35.86029\n",
       "1448     [UROPER6, UROPER6]  0.00015     0.09259   57.15592\n",
       "\n",
       "[589 rows x 4 columns]"
      ]
     },
     "execution_count": 68,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "list1 = []\n",
    "for i in range(df7.shape[0]):\n",
    "    if(len(df7.iloc[i][0]) == 2):\n",
    "        list1.append(i)\n",
    "        \n",
    "newdf1 = df7.iloc[list1,:]\n",
    "\n",
    "newdf1\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "adfef8e7",
   "metadata": {},
   "outputs": [
    {
     "ename": "KeyError",
     "evalue": "'Procedure1'",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mKeyError\u001b[0m                                  Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-72-18f748a7a6a3>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m\u001b[0m\n\u001b[1;32m----> 1\u001b[1;33m \u001b[0mnewdf1\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mmerge\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mdf4\u001b[0m\u001b[1;33m,\u001b[0m\u001b[0mhow\u001b[0m \u001b[1;33m=\u001b[0m \u001b[1;34m'left'\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mleft_on\u001b[0m \u001b[1;33m=\u001b[0m \u001b[1;33m[\u001b[0m\u001b[1;34m'Procedure1'\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;34m'Procedure2'\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m,\u001b[0m\u001b[0mright_on\u001b[0m \u001b[1;33m=\u001b[0m \u001b[1;33m[\u001b[0m\u001b[1;34m'Procedure1'\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;34m'Procedure2'\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[1;32m~\\anaconda3\\lib\\site-packages\\pandas\\core\\frame.py\u001b[0m in \u001b[0;36mmerge\u001b[1;34m(self, right, how, on, left_on, right_on, left_index, right_index, sort, suffixes, copy, indicator, validate)\u001b[0m\n\u001b[0;32m   8193\u001b[0m         \u001b[1;32mfrom\u001b[0m \u001b[0mpandas\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mcore\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mreshape\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mmerge\u001b[0m \u001b[1;32mimport\u001b[0m \u001b[0mmerge\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   8194\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m-> 8195\u001b[1;33m         return merge(\n\u001b[0m\u001b[0;32m   8196\u001b[0m             \u001b[0mself\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   8197\u001b[0m             \u001b[0mright\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m~\\anaconda3\\lib\\site-packages\\pandas\\core\\reshape\\merge.py\u001b[0m in \u001b[0;36mmerge\u001b[1;34m(left, right, how, on, left_on, right_on, left_index, right_index, sort, suffixes, copy, indicator, validate)\u001b[0m\n\u001b[0;32m     72\u001b[0m     \u001b[0mvalidate\u001b[0m\u001b[1;33m=\u001b[0m\u001b[1;32mNone\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     73\u001b[0m ) -> \"DataFrame\":\n\u001b[1;32m---> 74\u001b[1;33m     op = _MergeOperation(\n\u001b[0m\u001b[0;32m     75\u001b[0m         \u001b[0mleft\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     76\u001b[0m         \u001b[0mright\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m~\\anaconda3\\lib\\site-packages\\pandas\\core\\reshape\\merge.py\u001b[0m in \u001b[0;36m__init__\u001b[1;34m(self, left, right, how, on, left_on, right_on, axis, left_index, right_index, sort, suffixes, copy, indicator, validate)\u001b[0m\n\u001b[0;32m    666\u001b[0m             \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mright_join_keys\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    667\u001b[0m             \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mjoin_names\u001b[0m\u001b[1;33m,\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 668\u001b[1;33m         ) = self._get_merge_keys()\n\u001b[0m\u001b[0;32m    669\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    670\u001b[0m         \u001b[1;31m# validate the merge keys dtypes. We may need to coerce\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m~\\anaconda3\\lib\\site-packages\\pandas\\core\\reshape\\merge.py\u001b[0m in \u001b[0;36m_get_merge_keys\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m   1044\u001b[0m                         \u001b[0mright_keys\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mappend\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mrk\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   1045\u001b[0m                     \u001b[1;32mif\u001b[0m \u001b[0mlk\u001b[0m \u001b[1;32mis\u001b[0m \u001b[1;32mnot\u001b[0m \u001b[1;32mNone\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m-> 1046\u001b[1;33m                         \u001b[0mleft_keys\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mappend\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mleft\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_get_label_or_level_values\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mlk\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m   1047\u001b[0m                         \u001b[0mjoin_names\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mappend\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mlk\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   1048\u001b[0m                     \u001b[1;32melse\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m~\\anaconda3\\lib\\site-packages\\pandas\\core\\generic.py\u001b[0m in \u001b[0;36m_get_label_or_level_values\u001b[1;34m(self, key, axis)\u001b[0m\n\u001b[0;32m   1682\u001b[0m             \u001b[0mvalues\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0maxes\u001b[0m\u001b[1;33m[\u001b[0m\u001b[0maxis\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mget_level_values\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mkey\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_values\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   1683\u001b[0m         \u001b[1;32melse\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m-> 1684\u001b[1;33m             \u001b[1;32mraise\u001b[0m \u001b[0mKeyError\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mkey\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m   1685\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m   1686\u001b[0m         \u001b[1;31m# Check for duplicates\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mKeyError\u001b[0m: 'Procedure1'"
     ]
    }
   ],
   "source": [
    "newdf1.merge(df4,how = 'left', left_on = ['Procedure1','Procedure2'],right_on = ['Procedure1','Procedure2'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "37885e9b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Procedures</th>\n",
       "      <th>Support</th>\n",
       "      <th>Confidence</th>\n",
       "      <th>Lift</th>\n",
       "      <th>Procedure1</th>\n",
       "      <th>Procedure2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[EPS, RFA]</td>\n",
       "      <td>0.02145</td>\n",
       "      <td>0.49333</td>\n",
       "      <td>12.67224</td>\n",
       "      <td>EPS</td>\n",
       "      <td>RFA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[CAGM, PTCAP]</td>\n",
       "      <td>0.02130</td>\n",
       "      <td>0.15541</td>\n",
       "      <td>1.14488</td>\n",
       "      <td>CAGM</td>\n",
       "      <td>PTCAP</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[PTCAP, CAGM]</td>\n",
       "      <td>0.02071</td>\n",
       "      <td>0.15257</td>\n",
       "      <td>1.11317</td>\n",
       "      <td>PTCAP</td>\n",
       "      <td>CAGM</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[RFA, EPS]</td>\n",
       "      <td>0.01851</td>\n",
       "      <td>0.47547</td>\n",
       "      <td>10.93534</td>\n",
       "      <td>RFA</td>\n",
       "      <td>EPS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>[CAGM, A203]</td>\n",
       "      <td>0.00926</td>\n",
       "      <td>0.06756</td>\n",
       "      <td>2.77006</td>\n",
       "      <td>CAGM</td>\n",
       "      <td>A203</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1436</th>\n",
       "      <td>[UROPER29, OBGOPER27]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.12712</td>\n",
       "      <td>22.18475</td>\n",
       "      <td>UROPER29</td>\n",
       "      <td>OBGOPER27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1441</th>\n",
       "      <td>[UROPER5, UROPER7]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.34091</td>\n",
       "      <td>774.79339</td>\n",
       "      <td>UROPER5</td>\n",
       "      <td>UROPER7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1444</th>\n",
       "      <td>[UROPER7, UROPER3]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.34091</td>\n",
       "      <td>288.90601</td>\n",
       "      <td>UROPER7</td>\n",
       "      <td>UROPER3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1447</th>\n",
       "      <td>[UROPER1, OBGOPER27]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.20548</td>\n",
       "      <td>35.86029</td>\n",
       "      <td>UROPER1</td>\n",
       "      <td>OBGOPER27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1448</th>\n",
       "      <td>[UROPER6, UROPER6]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.09259</td>\n",
       "      <td>57.15592</td>\n",
       "      <td>UROPER6</td>\n",
       "      <td>UROPER6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>589 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                 Procedures  Support  Confidence       Lift Procedure1  \\\n",
       "11               [EPS, RFA]  0.02145     0.49333   12.67224        EPS   \n",
       "12            [CAGM, PTCAP]  0.02130     0.15541    1.14488       CAGM   \n",
       "14            [PTCAP, CAGM]  0.02071     0.15257    1.11317      PTCAP   \n",
       "16               [RFA, EPS]  0.01851     0.47547   10.93534        RFA   \n",
       "34             [CAGM, A203]  0.00926     0.06756    2.77006       CAGM   \n",
       "...                     ...      ...         ...        ...        ...   \n",
       "1436  [UROPER29, OBGOPER27]  0.00015     0.12712   22.18475   UROPER29   \n",
       "1441     [UROPER5, UROPER7]  0.00015     0.34091  774.79339    UROPER5   \n",
       "1444     [UROPER7, UROPER3]  0.00015     0.34091  288.90601    UROPER7   \n",
       "1447   [UROPER1, OBGOPER27]  0.00015     0.20548   35.86029    UROPER1   \n",
       "1448     [UROPER6, UROPER6]  0.00015     0.09259   57.15592    UROPER6   \n",
       "\n",
       "     Procedure2  \n",
       "11          RFA  \n",
       "12        PTCAP  \n",
       "14         CAGM  \n",
       "16          EPS  \n",
       "34         A203  \n",
       "...         ...  \n",
       "1436  OBGOPER27  \n",
       "1441    UROPER7  \n",
       "1444    UROPER3  \n",
       "1447  OBGOPER27  \n",
       "1448    UROPER6  \n",
       "\n",
       "[589 rows x 6 columns]"
      ]
     },
     "execution_count": 73,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "newdf2  = pd.DataFrame(newdf1['Procedures'].tolist(),columns=['Procedure1','Procedure2'],index = newdf1.index)\n",
    "newdf1 = pd.concat([newdf1,newdf2],axis = 1)\n",
    "newdf1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "9bae2516",
   "metadata": {},
   "outputs": [],
   "source": [
    "newdf1.to_csv('sssihms_scl.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "42adebfb",
   "metadata": {},
   "outputs": [],
   "source": [
    "newdf4 = newdf1.merge(df4,how = 'left', left_on = ['Procedure1','Procedure2'],right_on = ['Procedure1','Procedure2'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "id": "ecc6a611",
   "metadata": {},
   "outputs": [],
   "source": [
    "newdf4 = newdf4.drop('Procedures_y',axis=1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "id": "147d7a1b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Procedures_x</th>\n",
       "      <th>Support</th>\n",
       "      <th>Confidence</th>\n",
       "      <th>Lift</th>\n",
       "      <th>Procedure1</th>\n",
       "      <th>Procedure2</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[EPS, RFA]</td>\n",
       "      <td>0.02145</td>\n",
       "      <td>0.49333</td>\n",
       "      <td>12.67224</td>\n",
       "      <td>EPS</td>\n",
       "      <td>RFA</td>\n",
       "      <td>146</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[CAGM, PTCAP]</td>\n",
       "      <td>0.02130</td>\n",
       "      <td>0.15541</td>\n",
       "      <td>1.14488</td>\n",
       "      <td>CAGM</td>\n",
       "      <td>PTCAP</td>\n",
       "      <td>145</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[PTCAP, CAGM]</td>\n",
       "      <td>0.02071</td>\n",
       "      <td>0.15257</td>\n",
       "      <td>1.11317</td>\n",
       "      <td>PTCAP</td>\n",
       "      <td>CAGM</td>\n",
       "      <td>141</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[RFA, EPS]</td>\n",
       "      <td>0.01851</td>\n",
       "      <td>0.47547</td>\n",
       "      <td>10.93534</td>\n",
       "      <td>RFA</td>\n",
       "      <td>EPS</td>\n",
       "      <td>126</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[CAGM, A203]</td>\n",
       "      <td>0.00926</td>\n",
       "      <td>0.06756</td>\n",
       "      <td>2.77006</td>\n",
       "      <td>CAGM</td>\n",
       "      <td>A203</td>\n",
       "      <td>63</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>584</th>\n",
       "      <td>[UROPER29, OBGOPER27]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.12712</td>\n",
       "      <td>22.18475</td>\n",
       "      <td>UROPER29</td>\n",
       "      <td>OBGOPER27</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>585</th>\n",
       "      <td>[UROPER5, UROPER7]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.34091</td>\n",
       "      <td>774.79339</td>\n",
       "      <td>UROPER5</td>\n",
       "      <td>UROPER7</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>586</th>\n",
       "      <td>[UROPER7, UROPER3]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.34091</td>\n",
       "      <td>288.90601</td>\n",
       "      <td>UROPER7</td>\n",
       "      <td>UROPER3</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>587</th>\n",
       "      <td>[UROPER1, OBGOPER27]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.20548</td>\n",
       "      <td>35.86029</td>\n",
       "      <td>UROPER1</td>\n",
       "      <td>OBGOPER27</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>588</th>\n",
       "      <td>[UROPER6, UROPER6]</td>\n",
       "      <td>0.00015</td>\n",
       "      <td>0.09259</td>\n",
       "      <td>57.15592</td>\n",
       "      <td>UROPER6</td>\n",
       "      <td>UROPER6</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>589 rows × 7 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "              Procedures_x  Support  Confidence       Lift Procedure1  \\\n",
       "0               [EPS, RFA]  0.02145     0.49333   12.67224        EPS   \n",
       "1            [CAGM, PTCAP]  0.02130     0.15541    1.14488       CAGM   \n",
       "2            [PTCAP, CAGM]  0.02071     0.15257    1.11317      PTCAP   \n",
       "3               [RFA, EPS]  0.01851     0.47547   10.93534        RFA   \n",
       "4             [CAGM, A203]  0.00926     0.06756    2.77006       CAGM   \n",
       "..                     ...      ...         ...        ...        ...   \n",
       "584  [UROPER29, OBGOPER27]  0.00015     0.12712   22.18475   UROPER29   \n",
       "585     [UROPER5, UROPER7]  0.00015     0.34091  774.79339    UROPER5   \n",
       "586     [UROPER7, UROPER3]  0.00015     0.34091  288.90601    UROPER7   \n",
       "587   [UROPER1, OBGOPER27]  0.00015     0.20548   35.86029    UROPER1   \n",
       "588     [UROPER6, UROPER6]  0.00015     0.09259   57.15592    UROPER6   \n",
       "\n",
       "    Procedure2  count  \n",
       "0          RFA    146  \n",
       "1        PTCAP    145  \n",
       "2         CAGM    141  \n",
       "3          EPS    126  \n",
       "4         A203     63  \n",
       "..         ...    ...  \n",
       "584  OBGOPER27      1  \n",
       "585    UROPER7      1  \n",
       "586    UROPER3      1  \n",
       "587  OBGOPER27      1  \n",
       "588    UROPER6      1  \n",
       "\n",
       "[589 rows x 7 columns]"
      ]
     },
     "execution_count": 88,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "newdf4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "d0de1392",
   "metadata": {},
   "outputs": [],
   "source": [
    "newdf4.rename(columns={'Procedures_x':'Procedures'},inplace = True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "9a1f11ed",
   "metadata": {},
   "outputs": [],
   "source": [
    "newdf4.to_csv('sssihms_scl.csv')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "42f820dc",
   "metadata": {},
   "source": [
    "## Node Similarity"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "0d634743",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{}"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query1= '''CALL gds.graph.create(\n",
    "              'sequence1',\n",
    "              ['Patient','Encounter','Procedure'],\n",
    "              {\n",
    "                HAS_ENCOUNTER: {\n",
    "                  orientation: 'NATURAL'\n",
    "                },\n",
    "                HAS_PROCEDURE:{\n",
    "                    orientation: 'NATURAL'\n",
    "                },\n",
    "                NEXT:{\n",
    "                    orientation: 'NATURAL'\n",
    "                }\n",
    "              }\n",
    "            )\n",
    "\n",
    "        '''\n",
    "run(query1)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "5cac0127",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodePropertiesWritten</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>15868</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   nodePropertiesWritten\n",
       "0                  15868"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query1=  '''CALL gds.fastRP.mutate('sequence1',\n",
    "            {\n",
    "                embeddingDimension: 16,\n",
    "                randomSeed: 42,\n",
    "                mutateProperty: 'embedding',\n",
    "                // relationshipWeightProperty: 'amount',\n",
    "                iterationWeights: [0.8, 1, 1, 1]\n",
    "            }\n",
    "            )\n",
    "            YIELD nodePropertiesWritten\n",
    "\n",
    "        '''\n",
    "df5 = pd.DataFrame(graph.query(query1).to_data_frame())\n",
    "df5\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "6e1a3f67",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{}"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "query1= '''\n",
    "            CALL gds.beta.knn.write('sequence1', {\n",
    "                topK: 8,\n",
    "                nodeWeightProperty: 'embedding',\n",
    "                randomSeed: 42,\n",
    "                concurrency: 1,\n",
    "                sampleRate: 1.0,\n",
    "                deltaThreshold: 0.0,\n",
    "                writeRelationshipType: \"SIMILAR\",\n",
    "                writeProperty: \"score\"\n",
    "            })\n",
    "            YIELD nodesCompared, relationshipsWritten, similarityDistribution\n",
    "            RETURN nodesCompared, relationshipsWritten, similarityDistribution.mean as meanSimilarity\n",
    "        '''\n",
    "\n",
    "run(query1)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "46008cfe",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Patient1</th>\n",
       "      <th>Patient2</th>\n",
       "      <th>Similarity</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SUSANTA KUMAR DAS</td>\n",
       "      <td>SALMA BEGAM</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SALMA BEGAM</td>\n",
       "      <td>SUSANTA KUMAR DAS</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>JOSEPH</td>\n",
       "      <td>SUMITRA CHALAK</td>\n",
       "      <td>0.973823</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>SUMITRA CHALAK</td>\n",
       "      <td>JOSEPH</td>\n",
       "      <td>0.973823</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SHANTHALA R</td>\n",
       "      <td>SUKHEN BAGDI</td>\n",
       "      <td>0.971920</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20495</th>\n",
       "      <td>PRIYANGSHU KUMAR</td>\n",
       "      <td>USMAN KHAN</td>\n",
       "      <td>0.534594</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20496</th>\n",
       "      <td>PRIYANGSHU KUMAR</td>\n",
       "      <td>BARSHA KARMAKAR</td>\n",
       "      <td>0.532918</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20497</th>\n",
       "      <td>KHOKU MANI ADHIKARY</td>\n",
       "      <td>MATHIVANAN S</td>\n",
       "      <td>0.530098</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20498</th>\n",
       "      <td>SHASHIKALA.T.G</td>\n",
       "      <td>PRASNNA KUMAR MV</td>\n",
       "      <td>0.529070</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20499</th>\n",
       "      <td>SHASHIKALA.T.G</td>\n",
       "      <td>VIDYA K R</td>\n",
       "      <td>0.526456</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>20500 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                  Patient1           Patient2  Similarity\n",
       "0        SUSANTA KUMAR DAS        SALMA BEGAM    1.000000\n",
       "1              SALMA BEGAM  SUSANTA KUMAR DAS    1.000000\n",
       "2                   JOSEPH     SUMITRA CHALAK    0.973823\n",
       "3           SUMITRA CHALAK             JOSEPH    0.973823\n",
       "4              SHANTHALA R       SUKHEN BAGDI    0.971920\n",
       "...                    ...                ...         ...\n",
       "20495     PRIYANGSHU KUMAR         USMAN KHAN    0.534594\n",
       "20496     PRIYANGSHU KUMAR    BARSHA KARMAKAR    0.532918\n",
       "20497  KHOKU MANI ADHIKARY       MATHIVANAN S    0.530098\n",
       "20498       SHASHIKALA.T.G   PRASNNA KUMAR MV    0.529070\n",
       "20499       SHASHIKALA.T.G          VIDYA K R    0.526456\n",
       "\n",
       "[20500 rows x 3 columns]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = '''\n",
    "            MATCH (n:Patient)-[r:SIMILAR]->(m:Patient)\n",
    "            RETURN distinct n.Name as Patient1, m.Name as Patient2, r.score as Similarity\n",
    "            ORDER BY Similarity DESCENDING\n",
    "            '''\n",
    "df3 = pd.DataFrame(graph.query(query).to_data_frame())\n",
    "df3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "72726b35",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
